create table fauna
(
    id             serial primary key,
    name           text,
    avg_age        int,
    discovery_date date
);

insert into fauna (name, avg_age, discovery_date) values
('Африканский слон', 60, '1758-01-01'),
('Тигр', 25, '1758-01-01'),
('Гигантская панда', 20, '1869-03-23'),
('Белуга', 80, '1776-07-15'),
('Кенгуру', 22, '1798-04-12'),
('Пингвин императорский', 20, '1844-01-01'),
('Бурый медведь', 35, '1758-01-01'),
('Ягуар', 12, '1758-01-01'),
('Коала', 15, '1816-02-24'),
('Горилла горная', 40, '1902-10-17'),
('Носорог белый', 45, '1838-05-15'),
('Утконос', 10, '1799-01-01'),
('Лев', 18, '1758-01-01'),
('Зебра Пржевальского', 25, '1881-01-01'),
('Орангутан', 35, '1799-06-23'),
('Морской котик', 30, '1776-08-25'),
('Пума', 15, '1771-01-01'),
('Снежный барс', 12, '1786-09-11'),
('Ехидна', 16, '1792-12-04'),
('Красный волк', 10, '1792-05-02');

update fauna set discovery_date = null where name in ('Красный волк', 'Носорог белый')

select * from fauna where name = 'Морской котик';
select * from fauna where avg_age between 20 and 60;
select * from fauna where discovery_date is null;
select * from fauna where discovery_date < '1776-01-01';


